База_Back/src/Catalogs/отусВиртуальныеКарты/отусВиртуальныеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>отусВиртуальныеКарты</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодарочныйСертификат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

База_Back/src/AccumulationRegisters/отусБалансВиртуальныхКарт/отусБалансВиртуальныхКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>отусБалансВиртуальныхКарт</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Карта</name>
    <type>
      <types>CatalogRef.отусВиртуальныеКарты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

База_Back/src/Catalogs/отусВиртуальныеКарты/ManagerModule.bsl
Функция НайтиКарту(НомерТелефона) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Вт_Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Телефон = &Телефон
		|	И НЕ Контрагенты.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	отусВиртуальныеКарты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Вт_Карта
		|ИЗ
		|	Справочник.отусВиртуальныеКарты КАК отусВиртуальныеКарты
		|ГДЕ
		|	отусВиртуальныеКарты.Контрагент В
		|			(ВЫБРАТЬ
		|				Вт_Контрагент.Ссылка
		|			ИЗ
		|				Вт_Контрагент КАК Вт_Контрагент)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_Карта.Ссылка КАК Карта,
		|	Вт_Карта.Ссылка.Контрагент КАК Контрагент,
		|	отусБалансВиртуальныхКартОстатки.СуммаОстаток КАК Баланс
		|ИЗ
		|	Вт_Карта КАК Вт_Карта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.отусБалансВиртуальныхКарт.Остатки(
		|				,
		|				Карта В
		|					(ВЫБРАТЬ
		|						Вт_Карта.Ссылка
		|					ИЗ
		|						Вт_карта КАК Вт_Карта)) КАК отусБалансВиртуальныхКартОстатки
		|		ПО Вт_Карта.Ссылка = отусБалансВиртуальныхКартОстатки.Карта";
	
	Запрос.УстановитьПараметр("Телефон", НомерТелефона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
	
		Если Выборка.Следующий() Тогда 
			ДанныеКарты = Новый Структура("Карта, Баланс, Контрагент");
			ЗаполнитьЗначенияСвойств(ДанныеКарты, Выборка);
			Возврат ДанныеКарты;
		КонецЕсли;
	
	Иначе
		Возврат Новый Структура("Карта, Баланс, Контрагент");
	КонецЕсли;	
	
	
КонецФункции
